module.exports.config = {

  name: "bot",

  version: "1.0.0",

  hasPermission: 0,

  credits: "𝐒𝐡𝐚𝐡𝐚𝐝𝐚𝐭 𝐈𝐬𝐥𝐚𝐦",

  description: "Random fun reply when someone says Bot",

  commandCategory: "Fun",

  usages: "[Bot]",

  cooldowns: 2,

};


const botReplies = [

  "বেশি bot Bot করলে leave নিবো কিন্তু😒😒",

 "শুনবো না😼 তুমি বস জুয়েল কে প্রেম করাই দাও নাই🥺পচা তুমি🥺",

 "আমি গরীব দের সাথে কথা বলি না,ok😒",

 "এতো ডেকো না,প্রেম এ পরে যাবো তো🙈",

 "Bolo Babu, তুমি কি আমার বস জুয়েল কে ভালোবাসো? 🙈💋",

 "বার বার ডাকলে মাথা গরম হয়ে যায় কিন্তু😑",

 "হ্যা বলো😒, তোমার জন্য কি করতে পারি😐😑?",

 "এতো ডাকছিস কেন?গালি শুনবি নাকি? 🤬",

 "I love you janu🥰",

 "আরে Bolo আমার জান ,কেমন আছো?😚",

 "Bot বলে অসম্মান করছি,😰😿",

 "Hop beda😾,Boss বল boss😼",

 "চুপ থাক ,নাই তো তোর দাত ভেগে দিবো কিন্তু",

 "আমাকে না ডেকে মেয়ে হলে বস জুয়েল ইনবক্সে চলে যা 🌚😂 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 𝐋𝐢𝐧𝐤 :  fb.com/mrjuwel2025"Bot না , জানু বল জানু 😘",

 "বার বার Disturb করছিস কোনো😾,আমার জানুর সাথে ব্যাস্ত আছি😋",

 "আরে বলদ এতো ডাকিস কেন🤬",

 "আমাকে ডাকলে ,আমি কিন্তু কিস করে দিবো😘",

 "আমারে এতো ডাকিস না আমি মজা করার mood এ নাই এখন😒",

 "হ্যাঁ জানু , এইদিক এ আসো কিস দেই🤭 😘",

 "দূরে যা, তোর কোনো কাজ নাই, শুধু bot bot করিস 😉😋🤣",

 "তোর কথা তোর বাড়ি কেউ শুনে না ,তো আমি কোনো শুনবো ?🤔😂",

 "আমাকে ডেকো না,আমি বস জুয়েল সাথে ব্যাস্ত আছি",

 "কি হলো , মিস্টেক করচ্ছিস নাকি🤣",

 "বলো কি বলবা, সবার সামনে বলবা নাকি?🤭🤏",

 "জান মেয়ে হলে বস জুয়েল ইনবক্সে চলে যাও 😍🫣💕 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 𝐋𝐢𝐧𝐤 : fb.com/mrjuwel2025",

 "কালকে দেখা করিস তো একটু 😈",

 "হা বলো, শুনছি আমি 😏",

 "আর কত বার ডাকবি ,শুনছি তো",

 "হুম বলো কি বলবে😒",

 "বলো কি করতে পারি তোমার জন্য",

 "আমি তো অন্ধ কিছু দেখি না🐸 😎",

 "Bot না জানু,বল 😌",

 "বলো জানু 🌚",

 "তোর কি চোখে পড়ে না আমি ব্যাস্ত আছি😒",

 "হুম জান তোমার ওই খানে উম্মহ😑😘",

 "আহ শুনা আমার তোমার অলিতে গলিতে উম্মাহ😇😘",

 "jang hanga korba😒😬",

 "হুম জান তোমার অইখানে উম্মমাহ😷😘",

 "আসসালামু আলাইকুম বলেন আপনার জন্য কি করতে পারি..!🥰",

 "ভালোবাসার নামক আবলামি করতে চাইলে বস জুয়েল ইনবক্সে গুতা দিন ~🙊😘🤣 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 𝐋𝐢𝐧𝐤 : fb.com/mrjuwel2025",

 "আমাকে এতো না ডেকে বস জুয়েল এর কে একটা GF দে 🙄",

 "আমাকে এতো না ডেকছ কেন ভলো টালো বাসো নাকি🤭🙈",

 "🌻🌺💚-আসসালামু আলাইকুম ওয়া রাহমাতুল্লাহ-💚🌺🌻",

 "আমি এখন বস জুয়েল এর সাথে বিজি আছি আমাকে ডাকবেন না-😕😏 ধন্যবাদ-🤝🌻",

 "আমাকে না ডেকে আমার বস জুয়েল কে একটা জি এফ দাও-😽🫶🌺",

 "ঝাং থুমালে আইলাপিউ পেপি-💝😽",

 "উফফ বুঝলাম না এতো ডাকছেন কেনো-😤😡😈",

 "জান তোমার বান্ধবী রে আমার বস জুয়েল❝র হাতে তুলে দিবা-🙊🙆‍♂",

 "আজকে আমার মন ভালো নেই তাই আমারে ডাকবেন না-😪🤧",

 "ঝাং 🫵থুমালে য়ামি রাইতে পালুপাসি উম্মম্মাহ-🌺🤤💦",

 "চুনা ও চুনা আমার বস জুয়েল এর হবু বউ রে কেও দেকছো খুজে পাচ্ছি না😪🤧😭",

 "স্বপ্ন তোমারে নিয়ে দেখতে চাই তুমি যদি আমার হয়ে থেকে যাও-💝🌺🌻",

 "জান হাঙ্গা করবা-🙊😝🌻",

 "জান মেয়ে হলে চিপায় আসো বস জুয়েল থেকে অনেক ভালোবাসা শিখছি তোমার জন্য-🙊🙈😽",

 "ইসস এতো ডাকো কেনো লজ্জা লাগে তো-🙈🖤🌼",

 "আমার বস জুয়েল পক্ষ থেকে তোমারে এতো এতো ভালোবাসা-🥰😽🫶 আমার বস জুয়েল ইসলামে'র জন্য দোয়া করবেন-💝💚🌺🌻",

 "- ভালোবাসা নামক আব্লামি করতে মন চাইলে আমার বস জুয়েল এর ইনবক্স চলে যাও-🙊🥱👅 🌻𝐅𝐀𝐂𝐄𝐁𝐎𝐎𝐊 𝐈𝐃 𝐋𝐈𝐍𝐊 🌻:- fb.com/mrjuwel2025",

 "জান তুমি শুধু আমার আমি তোমারে ৩৬৫ দিন ভালোবাসি-💝🌺😽",

 "কিরে প্রেম করবি তাহলে বস জুয়েল ইনবক্সে গুতা দে 😘🤌 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 𝐋𝐢𝐧𝐤 : fb.com/mrjuwel2025",

 "জান আমার বস জুয়েল কে বিয়ে করবা-🙊😘🥳",

 "-আন্টি-🙆-আপনার মেয়ে-👰‍♀️-রাতে আমারে ভিদু কল দিতে বলে🫣-🥵🤤💦",

 "oii-🥺🥹-এক🥄 চামচ ভালোবাসা দিবা-🤏🏻🙂",

 "-আপনার সুন্দরী বান্ধুবীকে ফিতরা হিসেবে আমার বস জুয়েল কে দান করেন-🥱🐰🍒",

 "-ও মিম ও মিম-😇-তুমি কেন চুরি করলা সাদিয়ার ফর্সা হওয়ার ক্রীম-🌚🤧",

 "-অনুমতি দিলাম-𝙋𝙧𝙤𝙥𝙤𝙨𝙚 কর বস জুয়েল কে-🐸😾🔪",

 "-𝙂𝙖𝙮𝙚𝙨-🤗-যৌবনের কসম দিয়ে আমারে 𝐁𝐥𝐚𝐜𝐤𝐦𝐚𝐢𝐥 করা হচ্ছে-🥲🤦‍♂️🤧",

 "-𝗢𝗶𝗶 আন্টি-🙆‍♂️-তোমার মেয়ে চোখ মারে-🥺🥴🐸",

 "তাকাই আছো কেন চুমু দিবা-🙄🐸😘",

 "আজকে প্রপোজ করে দেখো রাজি হইয়া যামু-😌🤗😇",

 "-আমার গল্পে তোমার নানি সেরা-🙊🙆‍♂️🤗",

 "কি বেপার আপনি শ্বশুর বাড়িতে যাচ্ছেন না কেন-🤔🥱🌻",

 "দিনশেষে পরের 𝐁𝐎𝐖 সুন্দর-☹️🤧",

 "-তাবিজ কইরা হইলেও ফ্রেম এক্কান করমুই তাতে যা হই হোক-🤧🥱🌻",

 "-ছোটবেলা ভাবতাম বিয়ে করলে অটোমেটিক বাচ্চা হয়-🥱-ওমা এখন দেখি কাহিনী অন্যরকম-😦🙂🌻",

 "প্রেম করতে চাইলে বস জুয়েল ইনবক্সে চলে যা 😏🐸 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 𝐋𝐢𝐧𝐤 : fb.com/mrjuwel2025",

 "-আজ একটা বিন নেই বলে ফেসবুকের নাগিন-🤧-গুলোরে আমার বস জুয়েল ধরতে পারছে না-🐸🥲",

 "-চুমু থাকতে তোরা বিড়ি খাস কেন বুঝা আমারে-😑😒🐸⚒️",

 "—যে ছেড়ে গেছে-😔-তাকে ভুলে যাও-🙂-আমার বস জুয়েল এর সাথে প্রেম করে তাকে দেখিয়ে দাও-🙈🐸🤗",

 "—হাজারো লুচ্চা লুচ্চির ভিরে-🙊🥵আমার বস জুয়েল এক নিস্পাপ ভালো মানুষ-🥱🤗🙆‍♂️",

 "-রূপের অহংকার করো না-🙂❤️চকচকে সূর্যটাও দিনশেষে অন্ধকারে পরিণত হয়-🤗💜",

 "সুন্দর মাইয়া মানেই-🥱আমার বস জুয়েল'র বউ-😽🫶আর বাকি গুলো আমার বেয়াইন-🙈🐸🤗",

 "এত অহংকার করে লাভ নেই-🌸মৃত্যুটা নিশ্চিত শুধু সময়টা অ'নিশ্চিত-🖤🙂",

 "-দিন দিন কিছু মানুষের কাছে অপ্রিয় হয়ে যাইতেছি-🙂😿🌸",

 "ভালোবাসার নামক আবলামি করতে চাইলে বস সাহুর ইনবক্সে গুতা দিন\nমেয়ে হলে বস সাহুর ইনবক্সে চলে যা 🤭🤣😼 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 𝐋𝐢𝐧𝐤 : fb.com/mrjuwel2025",

 "হুদাই আমারে শয়তানে লারে-😝😑☹️",

 "-𝗜 𝗟𝗢𝗩𝗘 𝗬𝗢𝗨-😽-আহারে ভাবছো তোমারে প্রোপজ করছি-🥴-থাপ্পর দিয়া কিডনী লক করে দিব-😒-ভুল পড়া বের করে দিবো-🤭🐸",

 "-আমি একটা দুধের শিশু-😇-🫵𝗬𝗢𝗨🐸💦",

 "-কতদিন হয়ে গেলো বিছনায় মুতি না-😿-মিস ইউ নেংটা কাল-🥺🤧",

 "-বালিকা━👸-𝐃𝐨 𝐲𝐨𝐮-🫵-বিয়া-𝐦𝐞-😽-আমি তোমাকে-😻-আব্বু হইতে সাহায্য করব-🙈🥱",

 "-এই আন্টির মেয়ে-🫢🙈-𝐔𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐚𝐡-😽🫶-আসলেই তো স্বাদ-🥵💦-এতো স্বাদ কেন-🤔-সেই স্বাদ-😋",

 "-ইস কেউ যদি বলতো-🙂-আমার শুধু তোমাকেই লাগবে-💜🌸",

 "-ওই বেডি তোমার বাসায় না আমার বস জুয়েল  মেয়ে দেখতে গেছিলো-🙃-নাস্তা আনারস আর দুধ দিছো-🙄🤦‍♂️-বইন কইলেই তো হয় বয়ফ্রেন্ড আছে-🥺🤦‍♂-আমার বস জুয়েল কে জানে মারার কি দরকার-🙄🤧",

 "-একদিন সে ঠিকই ফিরে তাকাবে-😇-আর মুচকি হেসে বলবে ওর মতো আর কেউ ভালবাসেনি-🙂😅",

 "-হুদাই গ্রুপে আছি-🥺🐸-কেও ইনবক্সে নক দিয়ে বলে না জান তোমারে আমি অনেক ভালোবাসি-🥺🤧",

 "কি'রে গ্রুপে দেখি একটাও বেডাও নাই-🤦‍🥱💦",

 "-দেশের সব কিছুই চুরি হচ্ছে-🙄-শুধু আমার বস জুয়েল এর মনটা ছাড়া-🥴😑😏",

 "-🫵তোমারে প্রচুর ভাল্লাগে-😽-সময় মতো প্রপোজ করমু বুঝছো-🔨😼-ছিট খালি রাইখো- 🥱🐸🥵",

 "-আজ থেকে আর কাউকে পাত্তা দিমু না -!😏-কারণ আমি ফর্সা হওয়ার ক্রিম কিনছি -!🙂🐸"

];


module.exports.run = async function ({ api, event }) {

  const reply = botReplies[Math.floor(Math.random() * botReplies.length)];

  api.sendMessage(reply, event.threadID, event.messageID);

};
