module.exports.config = {
  name: "rules",
  version: "1.0.0",
  hasPermssion: 0,
  credits: "MR JUWEL",
  description: "Send group rules",
  commandCategory: "information",
  usages: "rules2",
  cooldowns: 5
};

module.exports.run = async ({ api, event }) => {
  const message = `
❐-আসসালামু আলাইকুম, 🖤🌺

❐- 𝙶𝚁𝙾𝚄𝙿 এর কিছু 𝚁𝚄𝙻𝙴𝚂 আছে, এগুলো হয়তো অনেকেই জানেন না।
যারা জানেন না তারা জেনে রাখেন ⬇️
<----------------------------------------------->

০১) আজেবাজে খারাপ কথা বলা যাবে না ⚠️  
০২) কাউকে অপমান কিংবা গালাগালি করা যাবে না ⚠️🚫  
০৩) অপ্রয়োজনীয় ট্যাগ / বারবার mention করা যাবে না 🚫  
০৪) SEX নিয়ে কোনো কথা বলা যাবে না ⚠️🚫  
০৫) অশ্লীল ছবি / ভিডিও / মিম দিলে সরাসরি কিক ⚡🚫  
০৬) নিজের ইউটিউব / পেজ লিংক দিয়ে স্প্যাম করলে কিক 🚫  
০৭) অ্যাডমিনদের সম্মান করতে হবে 🛡🌷  
০৮) কোনো ধর্ম বা জাতি নিয়ে কটাক্ষ করা যাবে না 🚫  
০৯) ভুয়া নিউজ / গুজব দিলে রিপোর্ট + ব্লক 🚫  
১০) রাত ১২টার পর শুধু ভদ্র মজা, অশ্লীলতা নয় 🚫  
১১) Meta AI এর সাথে গ্রুপে কথা বলা যাবে না 🚫  
১২) অপরিচিত কাউকে ইনবক্সে ডাকবেন না 🚫  
১৩) অপরিচিত কাউকে ফ্রেন্ড রিকুয়েস্ট দিবেন না 🚫  
১৪) অন্য গ্রুপের লিংক দিলে কিক 🚫  
১৫) আমাদের মেম্বারদের অন্য গ্রুপে এড করবেন না 🚫  
১৬) ৩টার বেশি ইমোজি ব্যবহার করবেন না 🚫  
১৭) গ্রুপের নাম / ফটো চেঞ্জ করলে কিক 🚫  
১৮) বারবার থিম / গ্রুপ ইমোজি চেঞ্জ করলে কিক 🚫  
১৯) ক্যাপশন বা ভিডিও পোস্ট করা যাবে না 🚫  
২০) 18+ কোনো ইমোজি দেওয়া যাবে না 🚫  
২১) আড্ডার সময় বটের সাথে কথা বলা যাবে না 🚫  
২২) গালি দিলে অ্যাডমিনের ইনবক্সে জানাবেন 🚫  
২৩) অন্য গ্রুপের বিষয় আলোচনা করবেন না 🚫  
২৪) গ্রুপ ভালো না লাগলে লিভ নিতে পারবেন 🚫  
২৫) 18+ নিকনেম ব্যবহার করা যাবে না 🚫  
২৬) 18+ নামের আইডি এড করা যাবে না 🚫  
২৭) কাউকে এড করলে তাকে নিয়ম জানাবেন 🚫  
২৮) যারা নিয়ম মানে না তাদের এড করবেন না 🚫  
২৯) কাউকে বিরক্ত করবেন না 🚫  
৩০) অন্যের নিকনেম চেঞ্জ করবেন না 🚫  
৩১) অন্যের নামে নিকনেম দিবেন না 🚫  
৩২) SPAM করবেন না 🚫  
৩৩) সমস্যা হলে অ্যাডমিনকে বলবেন 🚫  
৩৪) গ্রুপে ঝগড়া করবেন না 🚫  
৩৫) সবাই মিলেমিশে আড্ডা দিবেন 🌷😻

<----------------------------------------------->

❖ কোনো সমস্যা হলে সরাসরি 𝙰𝙳𝙼𝙸𝙽𝚂 দের ইনবক্স করুন 💌  
❖ রুলস ভাঙলে আগে ওয়ার্নিং, পরে অ্যাকশন 😈

𝙱𝙾𝚃 𝙰𝙳𝙼𝙸𝙽:
⎯꯭𓆩꯭𝆺𝅥😻⃞𝐌⃞𝆠፝֟𝐑᭄ღ倫 𝐉⃞𝐔⃞𝐖⃞𝐄⃞𝐋༢࿐  
FB: https://www.facebook.com/mrjuwel2025

_সাথেই থাকুন 🌺_
⎯꯭𓆩꯭𝆺𝅥😻⃞𝐑⃞𝐈⃞𝐘⃞𝐀⃞༢࿐

💖...........ধন্যবাদ সবাইকে...........💖
`;

  return api.sendMessage(message, event.threadID);
};
